{
  "Data-Monitor_desc_solution1_paragraph2": "Having supported the research data with corridor testing, it was possible to conduct a basic usability check, very quickly prepare the product for implementation, and also assess the viability of the hypothesis.",
  "Data-Monitor_desc_solution1_paragraph1": "Using Chat GPT to simulate users, we were able to very quickly carry out the research phase and immerse ourselves in the product and problem, as well as study competitive solutions, their advantages and disadvantages. Also with his help the following were compiled:",
  "Data-Monitor_desc_problem1": "Extreme deadlines for implementation. The result was needed yesterday.",
  "Data-Monitor_tag_solution1": "Solution #1",
  "Data-Monitor_tag_problem1": "Problem #1",
  "Data-Monitor_role1_txt": "Connected to help on an existing project to develop custom scripts, prototypes and final layouts.",
  "Data-Monitor_result2": "Finalization of the interface based on feedback - 2 days",
  "Data-Monitor_result1": "Creation of the first version of the product in 3 days",
  "Data-Monitor-task": "Application design development within extreme deadlines",
  "Data-Monitor-desc": "Factory workers, shop managers and directors requested the development of software that would allow them to monitor the status of units at the plant from a mobile device.",
  "Data-Monitor-Data": "January, 2024 — April, 2024",
  "Data-Monitor-Index": "Data Collection and Monitoring",
  "Cybersec_desc_solution1_paragraph2": "Having supported the research data with corridor testing, it was possible to conduct a basic usability check, very quickly prepare the product for implementation, and also assess the viability of the hypothesis.",
  "Cybersec_desc_solution1_paragraph1": "Using Chat GPT to simulate users, we were able to very quickly carry out the research phase and immerse ourselves in the product and problem, as well as study competitive solutions, their advantages and disadvantages. Also with his help the following were compiled:",
  "Cybersec_desc_problem1": "Extreme deadlines for implementation. The result was needed yesterday.",
  "Cybersec_tag_solution1": "Solution #1",
  "Cybersec_tag_problem1": "Problem #1",
  "Cybersec_role1_txt": "Connected to help on an existing project to develop custom scripts, prototypes and final layouts.",
  "Cybersec_result2": "Finalization of the interface based on feedback - 2 days",
  "Cybersec_result1": "Creation of the first version of the product in 3 days",
  "Cybersec-task": "Application design development within extreme deadlines",
  "Cybersec-desc": "Top managers of the company requested the development of a dashboard for mobile devices, with which they could track data on employees completing cybersecurity training. The importance of having this system in your pocket is determined by linking managers’ KPIs to employee testing and training.",
  "Cybersec-Data": "January, 2024 — March, 2024",
  "Cybersec-Index": "Cybersecurity",
  "Factory_desc_problem2": "Subjective decisions based on peer review were the norm for the team, and breaking those habits was not easy. Often, interface requirements were counterintuitive and illogical.",
  "Factory_desc_solution2": "The opportunity to go to users made it possible to solve this problem. The team prepared several interface options, some satisfied customers, some did not, but testing on users led to the fact that the subjective preferences of customers crashed against the rocks of the user’s real needs. The final decision, based on the test results, was the option proposed by my team.",
  "Factory_desc_problem1": "Before me, no one in the company had ever talked about usability and the need to conduct a research stage in product work. Colleagues did not understand why waste time on this.",
  "Factory_desc_solution1": "In order to convince the project team, a series of meetings were held with demonstrations of prepared materials in order to convincingly prove the need for conducting interviews with users, as well as testing, which would clearly show the effectiveness of the proposed new functionality. The project team and management were convinced, and 5 system users were allocated for testing.",
  "Factory_tag_problem2": "Problem #2",
  "Factory_tag_solution2": "Solution #2",
  "Factory_tag_problem1": "Problem #1",
  "Factory_tag_solution1": "Solution #1",
  "Factory_role2_txt": "Connected to help on an existing project to develop custom scripts, prototypes and final layouts.",
  "Factory_role1_txt": "Promoted a user-centric approach and emphasized the need for research and testing and consistently integrated them into the team's workflow. Conducted interviews with users, surveys and usability tests.",
  "Factory_result2": "100% of users rated the new interface functionality 5 out of 5",
  "Factory_result1": "Basic user tasks will now be completed 23% faster.",
  "Factory-task": "Reworking the current functionality of the catalog and cart",
  "Factory-desc": "The plant’s personal account is an online store for the company’s VIP clients. The users are top traders in Russia.",
  "Factory-Data": "January, 2023 — June, 2023",
  "Factory-Index": "Personal account Factory",
  "Trail_tag_solution1": "Solution #1",
  "Trail_desc_solution1": "We were able to conduct a series of corridor tests with colleagues, which allowed us to at least basicly test the hypotheses of the solution being developed. By cutting everything possible during the work process, our team managed to implement everything necessary within the established time frame.",
  "Trail_tag_problem1": "Problem #1",
  "Trail_desc_problem1": "The team’s small budget for product implementation led to the abandonment of most time-consuming processes. I had to give up in-depth research and user testing.",
  "Trail_role2_txt": "Responsible for the visionary component in terms of the design and content of the system, as well as for the connection between design and development. He built the rules for the operation of the token system and personally designed most of the component base.",
  "Trail_role1_txt": "A modest budget did not allow us to add a large number of designers. Taking one middle designer with me, I delegated tasks to him according to the priority I had defined.",
  "Trail_result5": "Development of a presentation template",
  "Trail_result4": "Creating a promotional landing page",
  "Trail_result3": "UX/UI design of product interface",
  "Trail_result2": "Creation of a logo and corporate identity",
  "Trail_result1": "The deadline for completing all tasks is 2 months.",
  "Trail_task": "Creating a product from scratch under extreme deadlines (what kind? I mean: what task were they assigned? It would be cool to reflect that you were told to complete it in 3 months, but you completed it in 2, for example). Full packaging for new product.",
  "Trail_desc": "Science Trail - The new research platform is designed to provide scientists, researchers and the academic community with an easy-to-use tool for searching, analyzing and interacting with academic papers and patents.",
  "Trail-Data": "September, 2023 — December, 2023",
  "Trail-Index": "Scientific trail",
  "Severstal_tag_solution4": "Solution #4",
  "Severstal_desc_solution4": "During synchronization with the branding department, we managed to prove (use active verbs! Not “we managed to prove”, but “our team proved A and B”) the need to refine the brand book and introduce a common standard for a dark theme in the company’s interfaces. This standard has been integrated into the design system.",
  "Severstal_tag_problem4": "Problem #4",
  "Severstal_desc_problem4": "The company did not have established principles by which the dark theme works. The brand book did not provide colors for this, but most of the customers wanted to have this function available, which is why we had many different dark themes made at the discretion of different teams.",
  "Severstal_tag_solution3": "Solution #3",
  "Severstal_desc_solution3_paragraph2": "A few months after the start, the team implemented its own plugin for Figma, which allows direct synchronization of tokens with the storybook via the API, for which you just need to fill out a couple of fields and press a button. (here I would like to see more of your role in all this. What exactly did you stand for? What exactly did you do?)",
  "Severstal_desc_solution3_paragraph1": "The first step was to find a way to upload through a third-party plugin in Figma. The developer was given a css file containing a set of variables, he processed them and integrated them into the storybook. It was fast, but still not fast enough to be called optimal.",
  "Severstal_tag_problem3": "Problem #3",
  "Severstal_desc_problem3": "At first, it was completely unclear how to organize the transfer of tokens to developers, because there are no native functions for this.",
  "Severstal_tag_solution2": "Solution #2",
  "Severstal_desc_solution2": "Through a huge number of meetings and synchronizations, we managed to build a process of interaction with all interested parties. Our team took the initiative to maintain the essence of the design system, while our colleagues switched to developing scenarios for their products. Synchronizing simultaneously with the requirements of our products and the requirements of our colleagues’ products, we managed, at the cost of enormous forces (I would remove the huge forces, these are emotions and they can work against you), to implement universal components that, using tokens, can be globally restructured and meet both the company’s needs and and narrow requests of related departments.",
  "Severstal_tag_problem2": "Problem #2",
  "Severstal_desc_problem2": "After we managed to obtain funds and a team was identified, we began work. However, it soon became clear that a related division was developing its own design system for a number of projects aimed at import substitution. Management thought it would be a good idea to combine these two activities, which I did not agree with, but I could not convince management of this. Now, instead of 1 design system designed for Severstal projects, it was necessary to create, in fact, 2 systems in one. The problem was exacerbated by the presence of pre-developed components from another team.",
  "Severstal_tag_solution1": "Solution #1",
  "Severstal_desc_solution1": "After preparing and analyzing the competitive field, I prepared a series of presentations for management, in which I outlined in numbers the advantages of having a design system. Having held several (150 and 5 is also a few; I would give a specific number) such meetings, I was able to convey the importance of the problem, after which the company allocated funds and people (how many units? How many people?).",
  "Severstal_tag_problem1": "Problem #1",
  "Severstal_desc_problem1": "The company and colleagues did not understand the urgent need for system design. The first thing we had to deal with was proving the feasibility of the company’s investments in this project, as well as allocating people for implementation.",
  "Severstal_role1_txt": "Directed the strategic vector of project development. Delegated tasks between two independent teams of a total of 4 designers. Defined priorities, validated results, organized and conducted meetings and presentations.",
  "Severstal_role2_txt": "Responsible for the visionary component in terms of the design and content of the system, as well as for the connection between design and development. He built the rules for the operation of the token system and personally designed most of the component base.",
  "Severstal_result1": "The required time to implement new company products has been reduced by 50% on the design side, and by 70% on the development side.",
  "Severstal_result2": "A single UI standard has been defined for all company interfaces;",
  "Severstal_result3": "The token system ensures adaptability and the presence of a pre-developed dark theme on board",
  "Severstal_result4": "The need to develop a dark theme as a corporate-wide interface standard and synchronization with the branding department has been proven",
  "Severstal_result5": "Flexibility of the system design allows you to customize its visual attributes to suit any brand",
  "Severstal_result6": "All new projects are developed using the design system",
  "SeverstalSystem_task": "Development of a multi-branding design system covering the entire range of corporation projects",
  "SeverstalSystem_desc": "The Severstal design system is a project that emerged from my initiative. The company produces a large number of products in different areas, but all this time it did not have a system design in any form, which is why most of the products looked heterogeneous, and the development teams had to implement UI kits from scratch each time.",
  "Severstal-Data": "June, 2023 — Current time",
  "Severstal-Index": "Design system Severstal",
  "Allforms_role3_txt": "Managed a team of two designers on a project, delegating and distributing tasks to optimize efficiency and accelerate achievement of project goals.",
  "Allforms_role2_txt": "Promoted a user-centric approach and emphasized the need for research and testing and consistently integrated them into the team's workflow. Conducted interviews with users, surveys and usability tests.",
  "Allforms_role1_txt": "Managed the full design lifecycle from logo creation and branding guidelines to developing custom scripts, prototypes and final mockups.",
  "AllForms_tag_problem1": "Problem #1",
  "AllForms_tag_problem2": "Problem #2",
  "AllForms_tag_problem3": "Problem #3",
  "AllForms_tag_solution1": "Solution #1",
  "AllForms_tag_solution2": "Solution #2",
  "AllForms_tag_solution3": "Solution #3",
  "AllForms_desc_solution3_paragraph1": "Switching to a licensed version of the Ant design system has significantly expanded our toolkit, allowing us to eliminate visual inconsistencies and seamlessly integrate dark theme, thereby increasing user satisfaction and expanding the product's audience.",
  "AllForms_desc_problem3": "The limited capabilities of the free Ant library for Figma made it difficult to implement modern design solutions and implement a dark theme into the project.",
  "AllForms_desc_solution2_paragraph2": "The designer was motivated and put on the path to testing hypotheses and a product approach. We managed to establish high-quality communication with the team through regular synchronization and demonstration of ideas and concepts.",
  "AllForms_desc_solution2_paragraph1": "My integration into the project as a design lead allowed for effective communication and collaboration within the team. We introduced a system of regular synchronizations, thanks to which we improved coordination and speed of work, ensuring smooth and accurate implementation of design into development.",
  "AllForms_desc_problem2": "Difficulties in communication between designers and developers led to inefficiencies and conflicts, slowing down the project's progress.",
  "AllForms_desc_solution1_paragraph7": "No critical problems were identified in the new version, but the team picked up a number of insights and ideas for the next versions of the product, and was also convinced of the feasibility, importance and correctness of the upcoming global changes.",
  "AllForms_desc_solution1_paragraph6": "As a result, all users successfully completed the tasks, users were able to solve their problems 43% faster than in the old version of the design, and also 15% faster than the competitive solutions with which the comparison was made. In addition, some feature branches showed particularly high performance, such as the “share access” functionality, in comparison with competitors, showed a result of 155% speedup in completing the task of this task.",
  "AllForms_desc_solution1_paragraph5": "Users were asked to go through an interactive prototype to solve their main tasks, such as creating a questionnaire, setting it up, sorting and editing it. During this event, usability metrics were collected, such as the speed and success of completing a task, the number of clicks, as well as the subjective feelings of respondents.",
  "AllForms_desc_solution1_paragraph4": "Two weeks after the start of work, the team was presented with a new concept for the main user scenario. After conducting corridor tests and making sure of the basic adequacy of the new UX, usability testing was organized with users of 7 people.",
  "AllForms_desc_solution1_paragraph3": "Having received and processed this data, the team, under my leadership, began designing a new version of the design.",
  "AllForms_desc_solution1_paragraph2": "An analysis of competitive offers on the market was also carried out to identify the optimal mechanics for solving similar problems.",
  "AllForms_desc_solution1_paragraph1": "To optimize both UX and UI, a set of measures was carried out to identify the user’s real pains and problems. The new process was designed to provide the team with insights and a list of priority problems that needed to be eliminated as quickly as possible. A number of user studies were conducted, on the basis of which we developed:",
  "AllForms_desc_problem1": "The project suffered from a mismatch between customer and user expectations: inconsistent product, complex and illogical user paths. This necessitated drastic changes.",
  "AllForms_result1": "Basic user tasks will now be completed 43% faster.",
  "AllForms_result2": "80% of users rated the new version of the interface 5 out of 5",
  "AllForms_result3": "A new development pipeline using tokens and Ant system design have been built.",
  "AllForms_result4": "A standard for the use of usability testing has been introduced",
  "AllForms_task1": "Complete redesign of the current solution with a simultaneous change of framework",
  "AllForms_task2": "Optimization of the design and development interaction process",
  "AllForms_desc": "AllForms is a project of an innovative platform for creating and managing online questionnaires, unusual Google Forms, Yandex Forms, Microsoft Forms. This service allows you to create custom questionnaires and surveys for research and feedback.",
  "My_role": "My role",
  "Allforms_data": "June, 2023 — January, 2024",
  "product_design": "Product designer",
  "lead_design": "Design lead",
  "system_design": "Design system expert",
  "title": "Ivan Kuznetsov",
  "lang": "Language",
  "read_cv": "read cv ↗",
  "about_me": "about me",
  "works_me": "works",
  "links": "Links",
  "about-subtitle": "About",
  "pos-sub": "Position",
  "pos-desc": "UX/UI Design lead",
  "exp-sub": "Experience",
  "exp-desc": "7+ years",
  "comp-sub": "Current company",
  "comp-desc": "Severstal Infocom",
  "deg-sub": "Degree",
  "btn_works_txt": "Previous page",
  "btn_next_project_txt": "Next project",
  "deg-desc": "Senior UX/UI Designer",
  "about-desc": "Highly experienced UX/UI designer with over 7 years of expertise in web and app digital product development, specializing in B2B products and industrial interfaces for various corporate processes, including monitoring and analytics systems, dashboarding systems, e-commerce projects, and HR systems.",
  "welcome__title": "Ivan Kuznetsov",
  "welcome__desc": "I’m a product designer working at the intersection of prototyping, visuals, systems. I’m currently at Severstal, making the world a little bit better for creators.",
  "Persons": "- Persons",
  "Empathy_cards": "- Empathy cards",
  "Task": "Task",
  "Result": "Result",
  "CAP": "Context and Problem",
  "Role3": "Lead design",
  "Role2": "UX researcher",
  "Role1": "Product designer",
  "location-abt": "Thailand, Pattaya"
}
