{
  "Data-Monitor_desc_solution1_paragraph2": "Подкрепив данные исследования коридорными тестированиями удалось провести базовую проверку юзабилити, крайне быстро подготовить продукт к реализации, а так же оценить жизнеспособность гипотезы.",
  "Data-Monitor_desc_solution1_paragraph1": "Использовав Chat GPT для симуляции пользователей удалось крайне быстро провести фазу исследования и погрузится в продукт и проблему, а так же изучить конкурентные решения, их преимущества и минусы. Так же с его помощью были составлены:",
  "Data-Monitor_desc_problem1": "Экстремальные сроки на реализацию. Результат нужен был вчера.",
  "Data-Monitor_tag_solution1": "Решение #1",
  "Data-Monitor_tag_problem1": "Проблема #1",
  "Data-Monitor_role1_txt": "Подключился для помощи на уже существующем проекте для разработки пользовательских сценариев, прототипов и окончательных макетов.",
  "Data-Monitor_result2": "Финализация интерфейса исходя из фидбека - 2 дня",
  "Data-Monitor_result1": "Создание первой версии продукта за 3 дня",
  "Data-Monitor-task": "Разработка дизайна приложения в экстремальные сроки",
  "Data-Monitor-desc": "Работники заводов, начальники цехов и директора запросили разработку ПО которое позволило бы им контролировать состояния агрегатов на заводе с мобильного устройства. ",
  "Data-Monitor-Data": "Январь, 2024 — Апрель, 2024",
  "Data-Monitor-Index": "Сбор и Мониторинг данных",
  "Cybersec_desc_solution1_paragraph2": "Подкрепив данные исследования коридорными тестированиями удалось провести базовую проверку юзабилити, крайне быстро подготовить продукт к реализации, а так же оценить жизнеспособность гипотезы.",
  "Cybersec_desc_solution1_paragraph1": "Использовав Chat GPT для симуляции пользователей удалось крайне быстро провести фазу исследования и погрузится в продукт и проблему, а так же изучить конкурентные решения, их преимущества и минусы. Так же с его помощью были составлены:",
  "Cybersec_desc_problem1": "Экстремальные сроки на реализацию. Результат нужен был вчера.",
  "Cybersec_tag_solution1": "Решение #1",
  "Cybersec_tag_problem1": "Проблема #1",
  "Cybersec_role1_txt": "Подключился для помощи на уже существующем проекте для разработки пользовательских сценариев, прототипов и окончательных макетов.",
  "Cybersec_result2": "Финализация интерфейса исходя из фидбека - 2 дня",
  "Cybersec_result1": "Создание первой версии продукта за 3 дня",
  "Cybersec-task": "Разработка дизайна приложения в экстремальные сроки",
  "Cybersec-desc": "Топ менеджеры компании запросили разработку дашборда для мобильных устройств, с помощью которого они бы могли отслеживать данные по прохождению сотрудниками тренингов по кибербезопасности. Важность наличия этой системы в кармане обуславливается привязкой KPI менеджеров к прохождениям сотрудниками тестирований и обучения.",
  "Cybersec-Data": "Январь, 2024 — Март, 2024",
  "Cybersec-Index": "Кибербезопасность",
  "Factory_desc_problem2": "Субъективные решения на основе экспертной оценкой были нормой для команды, а отход от этих привычек давался нелегко. Часто требования к интерфейсу противоречили здравому смыслу и были нелогичными.",
  "Factory_desc_solution2": "Возможность сходить к пользователям позволила решить и эту проблему. Командой было подготовлено несколько вариантов интерфейса, некоторые удовлетворяли заказчиков, некоторые нет, однако проверка на юзерах привела к тому, что субъективные предпочтения заказчиков разбились о скалы реальных потребностей пользователя. Итоговым решением, по результату тестирований был принят вариант предлагаемый моей командой. ",
  "Factory_desc_problem1": "До меня в компании никто никогда не говорил о юзабилити и необходимости проведения стадии исследования в продуктовой работе. Коллеги не понимали, зачем тратить время на это.",
  "Factory_desc_solution1": "Дабы убедить проектную команду был проведён ряд встреч с демонстрацией подготовленных материалов, дабы аргументированно доказать необходимость в проведении интервью с пользователями, а так же тестирований, который наглядно бы показали эффективность предлагаемых новых функциональных возможностей. Проектную команду и руководство удалось убедить, для тестирований выделили 5 пользователей системы.",
  "Factory_tag_problem2": "Проблема #2",
  "Factory_tag_solution2": "Решение #2",
  "Factory_tag_problem1": "Проблема #1",
  "Factory_tag_solution1": "Решение #1",
  "Factory_role2_txt": "Подключился для помощи на уже существующем проекте для разработки пользовательских сценариев, прототипов и окончательных макетов.",
  "Factory_role1_txt": "Продвигал юзероцентричный подход и подчеркивал необходимость исследований и тестов и последовательно интегрировал их в рабочий процесс команды. Проведил интервью с пользователями, опросы и юзабилити-тесты.",
  "Factory_result2": "100% пользователей оценили новый функционал интерфейса на 5 из 5",
  "Factory_result1": "Основные пользовательские задачи стали выполнятся на 23% быстрее.",
  "Factory-task": "Переработка текущего функционала каталога и корзины",
  "Factory-desc": "Личный кабинет завод - это интернет магазин для вип клиентов компании. Пользователями являются топ трейдеры России. ",
  "Factory-Data": "Январь, 2023 — Июнь, 2023",
  "Factory-Index": "Личный кабинет Завод",
  "Trail_tag_solution1": "Решение #1",
  "Trail_desc_solution1": "Удалось провести ряд коридорных тестирований с коллегами, что позволило хотя бы базово проверить гипотезы разрабатываемого решения. Сократив всё, что можно в процессе работы, нашей команде удалось реализовать всё необходимое в установленный срок. ",
  "Trail_tag_problem1": "Проблема #1",
  "Trail_desc_problem1": "Малый бюджет команды на реализацию продукта привёл к отказу от большей части время-затратных процессов. Пришлось отказаться от глубокого исследования и тестирований на пользователях.",
  "Trail_role2_txt": "Отвечал за визионерскую составляющую с точки зрения дизайна и наполненности системы, а так же за связку дизайна с разработкой. Построил правила работы токенной системы и собственноручно спроектировал большую часть компонентной базы.",
  "Trail_role1_txt": "Скромный бюджет не позволил усилится большим количеством дизайнеров. Взяв с собой одного мидл дизайнера я делегировал ему задачи по определенному мной приоритету",
  "Trail_result5": "Разработка шаблона презентаций",
  "Trail_result4": "Создание промо-лендинга",
  "Trail_result3": "UX/UI проектирование интерфейса продукта",
  "Trail_result2": "Создание логотипа и фирменного стиля",
  "Trail_result1": "Срок выполнения всех задач - 2 месяца.",
  "Trail_task": "Создание продукта с нуля в экстремальные сроки (какие? имею в виду: какую задачу поставили? Было бы круто отразить, что вам сказали успеть за 3 месяца, а вы справились за 2, например). Полная упаковка для нового продукта.",
  "Trail_desc": "Научный след - Новая исследовательская платформа предназначена для предоставления ученым, исследователям и академическому сообществу удобного инструмента поиска, анализа и взаимодействия с академическими работами и патентами.",
  "Trail-Data": "Сентябрь, 2023 — Декабрь, 2023",
  "Trail-Index": "Научный след",
  "Severstal_tag_solution4": "Решение #4",
  "Severstal_desc_solution4": "В ходе синхронизации с отделом брендинга удалось доказать (используй активные глаголы! Не “удалось доказать”, а “наша команда доказала А и Б”) необходимость доработки брендбука и введения общего стандарта для тёмной темы в интерфейсах компании. Этот стандарт был интегрирован в дизайн-систему.",
  "Severstal_tag_problem4": "Проблема #4",
  "Severstal_desc_problem4": "В компании не было устоявшихся принципов по которым работает тёмная тема. В брендбуке не было предусмотрено цветов для этого, однако большая часть заказчиков хотела иметь данную функцию в наличии, из-за чего у нас было множество разных тёмных тем сделанных на усмотрение разных команд.",
  "Severstal_tag_solution3": "Решение #3",
  "Severstal_desc_solution3_paragraph2": "Спустя несколько месяцев после начала команда реализовала собственный плагин для Figma который позволяет производить прямую синхронизацию токенов со сторибуком по API, для чего необходимо всего лишь заполнить пару полей и нажать кнопку. (вот тут хочется больше видеть именно твою роль во всем этом. За что выступал конкретно ты? Что сделал конкретно ты?)",
  "Severstal_desc_solution3_paragraph1": "Первым этапом мы нашли способ для выгрузки через сторонний плагин в Figma. Разработчику передавался css файл содержащий набор переменных, он обрабатывал их и интегрировал в сторибук. Это было быстро, но всё ещё недостаточно для того, чтобы назвать это оптимальным. ",
  "Severstal_tag_problem3": "Проблема #3",
  "Severstal_desc_problem3": "По началу, было совершенно непонятно как организовывать передачу токенов разработчикам, ведь нативных функций для этого нет.",
  "Severstal_tag_solution2": "Решение #2",
  "Severstal_desc_solution2": "Путём огромного количество встреч и синхронизаций удалось выстроить процесс взаимодействия со всеми заинтересованными лицами. Наша команда перехватила инициативу ведения сущности дизайн-системы, тогда как коллеги переключились на проработку сценариев своих продуктов. Синхронизируясь одновременно с требованиями наших продуктов, и требованиями продуктов коллег, нам удалось ценой огромных сил (про огромные силы я бы убрала, это эмоции и они могут сработать против тебя) реализовать универсальные компоненты, способные засчёт токенов глобально перестраиваться и соответствовать как запросам компании, так и узким запросам смежного подразделения. ",
  "Severstal_tag_problem2": "Проблема #2",
  "Severstal_desc_problem2": "После того как удалось получить средства и была определена команда мы приступили к работе. Однако вскоре выяснилось, что смежное подразделение разрабатывает свою дизайн-систему для ряда проектов нацеленных на импортозамещение. Руководство посчитало, что хорошей идеей будет объединить две эти активности, с чем я был не согласен, однако убедить руководство в этом не удалось. Теперь, вместо 1 дизайн системы расчитаной на проекты Северстали, было необходимо сделать, по сути 2 системы в одной. Проблема усугублялось наличием предразработаных компонентов другой команды.",
  "Severstal_tag_solution1": "Решение #1",
  "Severstal_desc_solution1": "Проведя подготовку и анализ конкурентного поля я подготовил ряд презентаций для руководства, в которых изложил на цифрах преимущества наличия дизайн-системы. Проведя несколько (150 и 5 это тоже несколько; я бы дала конкретную цифру) подобных встреч мне удалось донести важность проблемы, после чего компания выделила средства и людей (сколько соедств? сколько человек?). ",
  "Severstal_tag_problem1": "Проблема #1",
  "Severstal_desc_problem1": "У компании и коллег не было понимания острой необходимости дизайн системы. Первым, с чем пришлось иметь дело это доказательством целесообразности вложений компании в этот проект, а так же выделением людей для реализации. ",
  "Severstal_role1_txt": "Направлял стратегический вектор развития проекта. Делегировал задачи между двумя независимыми командами суммарно из 4 дизайнеров. Определял приоритеты, валидировал результат, организовывал и проводил встречи и презентации. ",
  "Severstal_role2_txt": "Отвечал за визионерскую составляющую с точки зрения дизайна и наполненности системы, а так же за связку дизайна с разработкой. Построил правила работы токенной системы и собственноручно спроектировал большую часть компонентной базы.",
  "Severstal_result1": "Требуемое время на реализацию новых продуктов компании сокращено на 50% со стороны дизайна, и на 70% со стороны разработки.",
  "Severstal_result2": "Определен единый UI стандарт для всех интерфейсов компании;",
  "Severstal_result3": "Токеная система обеспечивает адаптивность и наличие предразработаной тёмной темы на борту",
  "Severstal_result4": "Доказана необходимость разработки тёмной темы в качестве общекорпоративного интерфейсного стандарта и синхронизация с отделом брендинга",
  "Severstal_result5": "Гибкость дизайн системы позволяет настроить её визуальные атрибуты под любой бренд",
  "Severstal_result6": "Все новые проекты разрабатываются на дизайн системе",
  "SeverstalSystem_task": "Разработка мульти-брендинговой дизайн системы, охватывающей весь спектр проектов корпорации",
  "SeverstalSystem_desc": "Дизайн система Северстали - это проект появившийся из моей инициативы. Компания производит большое количество продуктов разной направленности, однако всё это время не имела дизайн системы ни в каком виде, из-за чего большая часть продуктов выглядела разнородно, а командам разработки приходилось каждый раз реализовывать UI kit’ы с чистого листа.",
  "Severstal-Data": "Июнь, 2023 — Текущее время",
  "Severstal-Index": "Дизайн система Северсталь",
  "Allforms_role3_txt": "Руководил командой из двух дизайнеров на проектом, делегируя и распределяя задачи для оптимизации эффективности и ускорения достижения целей проекта.",
  "Allforms_role2_txt": "Продвигал юзероцентричный подход и подчеркивал необходимость исследований и тестов и последовательно интегрировал их в рабочий процесс команды. Проведил интервью с пользователями, опросы и юзабилити-тесты.",
  "Allforms_role1_txt": "Управлял полным жизненным циклом дизайна: от создания логотипа и разработки рекомендаций по брендингу до разработки пользовательских сценариев, прототипов и окончательных макетов.",
  "AllForms_tag_problem1": "Проблема #1",
  "AllForms_tag_problem2": "Проблема #2",
  "AllForms_tag_problem3": "Проблема #3",
  "AllForms_tag_solution1": "Решение #1",
  "AllForms_tag_solution2": "Решение #2",
  "AllForms_tag_solution3": "Решение #3",
  "AllForms_desc_solution3_paragraph1": "Переход на лицензионную версию дизайн-системы Ant значительно расширил наш инструментарий, позволив нам исключить несоответствия в визуальном оформлении и гладко интегрировать темную тему, тем самым повысив удовлетворенность пользователей и расширив аудиторию продукта.,",
  "AllForms_desc_problem3": "Ограниченные возможности бесплатной библиотеки Ant для Figma затрудняли реализацию современных дизайнерских решений и внедрение темной темы в проект. ",
  "AllForms_desc_solution2_paragraph2": "Дизайнера удалось мотивировать и наставить на путь проверки гипотез и продуктового подхода. С командой удалось наладить качественную коммуникацию путём регулярных синхронизаций и демонстрации идей и концепций. ",
  "AllForms_desc_solution2_paragraph1": "Моя интеграция в проект в качестве дизайн-лида позволила установить эффективную коммуникацию и сотрудничество в команде. Мы ввели систему регулярных синхронизаций, благодаря которым улучшили координацию и скорость работы, обеспечивая плавное и точное внедрение дизайна в разработку.",
  "AllForms_desc_problem2": "Сложности во взаимодействии между дизайнерами и разработчиками приводили к неэффективной работе и конфликтам, замедляя процесс реализации проекта.",
  "AllForms_desc_solution1_paragraph7": "Критических проблем в новой версии не было выявлено, однако команда подчерпнула ряд инсайтов и идей для следующих версий продукта, а так же убедилась в целесообразности, важности и правильности грядущих глобальных изменений. ",
  "AllForms_desc_solution1_paragraph6": "По итогу - все пользователи успешно справились с выполнением задач, пользователи смогли решить свои задачи на 43% быстрее чем в старой версии дизайна, а так же на 15% быстрее чем конкурентные решения с которыми происходило сравнение. Помимо этого, некоторые функциональные ветки показали особенно высокую результативность, как например функционал “поделиться доступом” в сравнении с конкурентами показал результат в 155% ускорения выполнения задачи этой задачи.",
  "AllForms_desc_solution1_paragraph5": "Пользователям предлагалось пройти через интерактивный прототип для решения своих основных задач, таких как - создание опросника, его настройка, сортировка и редактирование. В ходе этого мероприятия собирались метрики юзабилити, такие как скорость и успешность выполнения задачи, количество кликов, а так же субъективные ощущения респондентов.",
  "AllForms_desc_solution1_paragraph4": "Через две недели после старта работ команде была представлена новая концепция основного пользовательского сценария. Проведя коридорные тесты и убедившись в базовой адекватности нового UX, были организованы юзабилити тестирования с пользователями в количестве 7 человек.",
  "AllForms_desc_solution1_paragraph3": "Получив и обработав эти данные команда, под моим руководством, приступила к проектированию новой версии дизайна. ",
  "AllForms_desc_solution1_paragraph2": "Так же был проведён анализ конкурентных предложений на рынке для выявления оптимальных механик для решения сходных задач.",
  "AllForms_desc_solution1_paragraph1": "Для оптимизации как UX, так и UI, был произведён комплекс мероприятий по выявлению реальных болей и проблем пользователя. Новый процесс был призван в максимально сжатые сроки обеспечить команду инсайтами и списком первостепенных проблем необходимых для устранения. Был проведён ряд исследований с пользователями, на базе которых мы разработали:",
  "AllForms_desc_problem1": "Проект страдал от несоответствия ожиданий заказчиков и пользователей: неконсистентность продукта, сложные и нелогичные пользовательские пути. Это вызвало необходимость кардинальных изменений.",
  "AllForms_result1": "Основные пользовательские задачи стали выполнятся на 43% быстрее.",
  "AllForms_result2": "80% пользователей оценили новую версию интерфейса на 5 из 5",
  "AllForms_result3": "Выстроен новый пайплайн разработки с применением токенов и дизайн системы Ant.",
  "AllForms_result4": "Внедрён стандарт применения юзабилити тестирований",
  "AllForms_task1": "Полный редизайн текущего решения c одновременной сменой фреймворка",
  "AllForms_task2": "Оптимизация процесса взаимодействия дизайн и разработки",
  "AllForms_desc": "AllForms - это проект инновационной платформы для создания и управления онлайн-анкетами, необычной Google Forms, Яндекс Формы, Microsoft Forms. Этот сервис позволяет создавать пользовательские анкеты и опросы для исследований, обратной связи.",
  "My_role": "Моя роль",
  "Allforms_data": "Июнь, 2023 — Январь, 2024",
  "product_design": "Продуктовый дизайнер",
  "lead_design": "Ведущий дизайнер",
  "system_design": "Эксперт дизайн систем",
  "title": "Иван Кузнецов",
  "lang": "Язык",
  "read_cv": "резюме ↗",
  "about_me": "обо мне",
  "works_me": "работы",
  "links": "Ссылки",
  "about-subtitle": "Обо мне",
  "pos-sub": "Позиция",
  "pos-desc": "UX/UI Design lead",
  "exp-sub": "Опыт работы",
  "exp-desc": "7+ года",
  "comp-sub": "Текущая компания",
  "comp-desc": "Северсталь Инфоком",
  "deg-sub": "Уровень",
  "btn_works_txt": "Предыдущая страница",
  "btn_next_project_txt": "Следующий проект",
  "deg-desc": "Senior UX/UI Designer",
  "about-desc": "UX/UI дизайнер с более чем 7-летним опытом разработки веб- и мобильных приложений, специализирующийся на продуктах B2B и промышленных интерфейсах для различных корпоративных процессов, включая системы мониторинга и аналитики, дэшборды, проекты электронной коммерции и HR-системы.",
  "welcome__title": "Иван Кузнецов",
  "welcome__desc": "Я дизайнер продуктов, работаю на стыке прототипирования, визуальных эффектов и систем. Сейчас я работаю в «Северстали», делаю мир немного лучше для авторов.",
  "Persons": "- Персоны",
  "Empathy_cards": "- Карты эмпатии",
  "Task": "Задача",
  "Result": "Результат",
  "CAP": "Контекст и проблема",
  "Role3": "Дизайн лид",
  "Role2": "UX-исследователь",
  "Role1": "Продуктовый дизайнер",
  "location-abt": "Тайланд, Паттайя"
}
